---
kind: method
id: M:Autodesk.Revit.DB.DWFImportOptions.SetSheetViews(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
source: html/94fa19b9-1e01-2066-923a-f4af50ce270d.htm
---
# Autodesk.Revit.DB.DWFImportOptions.SetSheetViews Method

Set sheet views where DWF markups are imported.

## Syntax (C#)
```csharp
public void SetSheetViews(
	IList<ElementId> sheetViews
)
```

## Parameters
- **sheetViews** (`System.Collections.Generic.IList < ElementId >`) - An array of imported sheet views.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null